#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
#include <stdlib.h>

//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
//A选手说：B第二，我第三；
//B选手说：我第二，E第四；
//C选手说：我第一，D第二；
//D选手说：C最后，我第三；
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次（考虑并列的可能性）。

int main()
{
	int A = 0, B = 0, C = 0, D = 0, E = 0;
	for (A = 1; A < 6; A++)
	{
		for (B = 1; B < 6; B++)
		{
			for (C = 1; C < 6; C++)
			{
				for (D = 1; D < 6; D++)
				{
					for (E = 1; E < 6; E++)
					{
						if ((B == 2) + (A == 3) == 1 && (B == 2) + (E == 4) == 1 && (C == 1) + (D == 2) == 1 && (C == 5) + (D == 3) == 1 && (E == 4) + (A == 1) == 1)
						{
							int val = 0;
							int flag = 0;							
							//将排名映射到一个二进制表达形式中：
							//如果排名为1,2,3,4,5，那么val为0000....11111，连续
							//如果排名为1,2,2,3,4，那么val为0000....01111，连续
							//如果排名为1,3,3,4,5，那么val为0000....11101，不连续
							val |= (1 << (A - 1));
							val |= (1 << (B - 1));
							val |= (1 << (C - 1));
							val |= (1 << (D - 1));
							val |= (1 << (E - 1));
							while (val) //判断排名是否连续
							{
								if (val % 2 == 0)
								{
									flag = 1;
									break;
								}
								val = val >> 1;
							}
							if (flag == 0)
							{
								printf("名次分别为：A第%d  B第%d  C第%d  D第%d  E第%d\n", A, B, C, D, E);
							}
						}
					}
				}
			}
		}
	}
	system("pause");
	return 0;
}